#include <stdio.h>
int main(void) {
    unsigned long long num = 1;
    short cnt = 0;
    short n;
    scanf("%hd", &n);
    while (cnt++ < n) {
        printf("%llu ", num);
        num *= 1024;
    }
    printf("\n");
    return 0;
}
/* постфиксный инкремент это когда к переменной добавляется единица 
уже после операции над переменой,
а префиксная форма когда +1 до самой операции.

В данной задаче это важно потому что происходят операции
над переменными и разные формы могут влиять на результат

*/




